Autodesk.Revit.DB.Structure.BendingDetailInternals.ResetLeaderOptionsForRealisticBendingDetail(Autodesk.Revit.DB.IndependentTag)
Resets all the leader options for the realistic bending detail element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.BendingDetailInternals.GetTagHeadRelativeAngle(Autodesk.Revit.DB.IndependentTag)
Gets the tag head angle relative to the bending detail element angle
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.BendingDetailInternals.SetTagHeadRelativeAngle(Autodesk.Revit.DB.IndependentTag,System.Double)
Sets the tag head angle relative to the bending detail element angle
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.BendingDetailInternals.GetTagHeadRelativeOffset(Autodesk.Revit.DB.IndependentTag)
Gets the tag head offset relative to the bending detail element position
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.BendingDetailInternals.SetTagHeadRelativeOffset(Autodesk.Revit.DB.IndependentTag,Autodesk.Revit.DB.XYZ)
Sets the tag head offset relative to the bending detail element position
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.BendingDetailInternals.GetAssociatedBendingDetails(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Retruns the ids of the bending details associated with this element.
Document:
The document that contains the bending details
elemId:
The element id
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.BendingDetailInternals.HasDefaultTagPosition(Autodesk.Revit.DB.Element)
Returnes true if the relative position and rotation for the tag in the realistic bending details where not changed.
bendingDetailId:
The realistic bending detail element id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.BendingDetailInternals.UpdateTagPositionForRealisticBendingDetail(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Document)
Recompute and updates the tag position relative to the realistic bending detail
Remarks:
This funciton was implemented on Revit side because it is used by the BendingDetailEditor and the Bending detail plugin.
bendingDetailId:
The realistic bending detail element id.
DBViewId:
The id of the view that owns the bending detail element.
ADocument:
The document that owns the bending detail element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.BendingDetailInternals.CreateGGroup(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject})
Aggregates an array of GNodes under one GNode.
An array of GNodes to aggregate.
Returns:
Returns a GNode containing all the GNodes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.BendingDetailInternals.AlterDimensionGraphics(System.Boolean,System.Boolean,Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.XYZ,System.String,System.String,Autodesk.Revit.DB.Document,System.Double,System.Boolean,Autodesk.Revit.DB.GeometryObject)
It will replace the text's content with contentText (if is not an empty string).
If the text generated by the dimension is between the bar segment and dimension extension curve (line/arc), it will be moved on the other part of the dimension extension curve (line/arc).
If contentAlternateText is non empty, a new text with this string as content will be created on the other part of the dimension extension curve
If removeAllButText, the returned graphics will contin just the texts
adjustTextSide:
If true, it will calcualte if the text is "inside" the dimension using outsideDir. If it's inside it will be moved on the opposite part.
centerAlternateText:
If true adjust the position of the alternate text to be centered relative to the content text in the direction of the text.
dimensionExtensionCurve:
The dimension extension curve (line/arc).
outsideDir:
The direction which means that is "outside" of the segment.
Starting from the segment in this direction it should be the dimension extension curve (line/arc) and than the text.
contentText:
The new content for the text that already exists in the dimension geometry .
contentAlternateText:
If this is non empty, a text on the oppsite part of the dimenion extendion curve will be created.
document:
The Document which was used to compute the dimension's geometry.
modelToSheetScale:
1 / The view scale.
removeAllButText:
If this is true, only the texts from dimenion grapics will be returned.
dimensionGeometry:
The geometry of the dimension.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null